qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/SPI_LPC5411x.h
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2016 ARM Ltd.
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *
 * $Date:        16. February 2016
 * $Revision:    V1.0
 *
 * Project:      SPI Driver Definitions for NXP LPC5411x
 * -------------------------------------------------------------------------- */

#ifndef __SPI_LPC5411X_H
#define __SPI_LPC5411X_H

#include <string.h>

#include "chip.h"
#include "Driver_SPI.h"

#include "RTE_Components.h"
#include "RTE_Device.h"

#if ((defined(RTE_Drivers_SPI0) || \
      defined(RTE_Drivers_SPI1) || \
      defined(RTE_Drivers_SPI2) || \
      defined(RTE_Drivers_SPI3) || \
      defined(RTE_Drivers_SPI4) || \
      defined(RTE_Drivers_SPI5) || \
      defined(RTE_Drivers_SPI6) || \
      defined(RTE_Drivers_SPI7))   \
     && ((RTE_FC0 == 0) || (RTE_FC0_PERSEL != 1)) \
     && ((RTE_FC1 == 0) || (RTE_FC1_PERSEL != 1)) \
     && ((RTE_FC2 == 0) || (RTE_FC2_PERSEL != 1)) \
     && ((RTE_FC3 == 0) || (RTE_FC3_PERSEL != 1)) \
     && ((RTE_FC4 == 0) || (RTE_FC4_PERSEL != 1)) \
     && ((RTE_FC5 == 0) || (RTE_FC5_PERSEL != 1)) \
     && ((RTE_FC6 == 0) || (RTE_FC6_PERSEL != 1)) \
     && ((RTE_FC7 == 0) || (RTE_FC7_PERSEL != 1)))

#error "Flexcomm Interface not configured for SPI in RTE_Device.h!"
#endif

/* Enable SPI instances */
#if (RTE_FC0 != 0) && (RTE_FC0_PERSEL == 1) /* SPI0 */
  #define RTE_SPI0               1

  #if (RTE_FC0_SCK_EN == 0)
    #error "Mandatory SPI0 SCK pin is not configured in RTE_Device.h!"
  #endif
  #if (RTE_FC0_RXD_SDA_MOSI_EN == 0)
    #error "Mandatory SPI0 MOSI pin is not configured in RTE_Device.h!"
  #endif
  #if (RTE_FC0_TXD_SCL_MISO_EN == 0)
    #error "Mandatory SPI0 MOSI pin is not configured in RTE_Device.h!"
  #endif

  #define SPI0_MOSI_PORT         RTE_FC0_RXD_SDA_MOSI_PORT
  #define SPI0_MOSI_PIN          RTE_FC0_RXD_SDA_MOSI_PIN
  #define SPI0_MOSI_FUNC         RTE_FC0_RXD_SDA_MOSI_FUNC

  #define SPI0_MISO_PORT         RTE_FC0_TXD_SCL_MISO_PORT
  #define SPI0_MISO_PIN          RTE_FC0_TXD_SCL_MISO_PIN
  #define SPI0_MISO_FUNC         RTE_FC0_TXD_SCL_MISO_FUNC

  #define SPI0_SCK_PORT          RTE_FC0_SCK_PORT
  #define SPI0_SCK_PIN           RTE_FC0_SCK_PIN
  #define SPI0_SCK_FUNC          RTE_FC0_SCK_FUNC

  #if ((RTE_FC0_CTS_SDA_SSEL0_EN +RTE_FC0_RTS_SCL_SSEL1_EN) > 1)
    #error "Select only one pin for SPI0 SSEL (FC0_CTS_SDA_SSEL0 or FC0_RTS_SCL_SSEL1) in RTE_Device.h!"
  #endif

  #if (RTE_FC0_CTS_SDA_SSEL0_EN != 0)
    #define SPI0_SSEL_PORT       RTE_FC0_CTS_SDA_SSEL0_PORT
    #define SPI0_SSEL_PIN        RTE_FC0_CTS_SDA_SSEL0_PIN
    #define SPI0_SSEL_FUNC       RTE_FC0_CTS_SDA_SSEL0_FUNC
    #define SPI0_SSEL_NUM        0
  #endif
  #if (RTE_FC0_RTS_SCL_SSEL1_EN != 0)
    #define SPI0_SSEL_PORT       RTE_FC0_RTS_SCL_SSEL1_PORT
    #define SPI0_SSEL_PIN        RTE_FC0_RTS_SCL_SSEL1_PIN
    #define SPI0_SSEL_FUNC       RTE_FC0_RTS_SCL_SSEL1_FUNC
    #define SPI0_SSEL_NUM        1
  #endif

  #if (RTE_FC0_DMA_RX_I2CS != 0) || (RTE_FC0_DMA_TX_I2CM != 0)
    #if (RTE_FC0_DMA_RX_I2CS != 0) && (RTE_FC0_DMA_TX_I2CM != 0)
      #define SPI0_DMA_EN        1
    #else
      #error "SPI0 requires Rx and Tx channel configured in RTE_Device.h when using DMA data transfer!"
    #endif
  #endif
#endif

#if (RTE_FC1 != 0) && (RTE_FC1_PERSEL == 1) /* SPI1 */
  #define RTE_SPI1               1

  #if (RTE_FC1_SCK_EN == 0)
    #error "Mandatory SPI1 SCK pin is not configured in RTE_Device.h!"
  #endif
  #if (RTE_FC1_RXD_SDA_MOSI_EN == 0)
    #error "Mandatory SPI1 MOSI pin is not configured in RTE_Device.h!"
  #endif
  #if (RTE_FC1_TXD_SCL_MISO_EN == 0)
    #error "Mandatory SPI1 MISO pin is not configured in RTE_Device.h!"
  #endif

  #define SPI1_MOSI_PORT         RTE_FC1_RXD_SDA_MOSI_PORT
  #define SPI1_MOSI_PIN          RTE_FC1_RXD_SDA_MOSI_PIN
  #define SPI1_MOSI_FUNC         RTE_FC1_RXD_SDA_MOSI_FUNC

  #define SPI1_MISO_PORT         RTE_FC1_TXD_SCL_MISO_PORT
  #define SPI1_MISO_PIN          RTE_FC1_TXD_SCL_MISO_PIN
  #define SPI1_MISO_FUNC         RTE_FC1_TXD_SCL_MISO_FUNC

  #define SPI1_SCK_PORT          RTE_FC1_SCK_PORT
  #define SPI1_SCK_PIN           RTE_FC1_SCK_PIN
  #define SPI1_SCK_FUNC          RTE_FC1_SCK_FUNC

  #if ((RTE_FC1_CTS_SDA_SSEL0_EN + RTE_FC1_RTS_SCL_SSEL1_EN) > 1)
    #error "Select only one pin for SPI1 SSEL (FC1_CTS_SDA_SSEL0 or FC1_RTS_SCL_SSEL1) in RTE_Device.h!"
  #endif

  #if (RTE_FC1_CTS_SDA_SSEL0_EN != 0)
    #define SPI1_SSEL_PORT       RTE_FC1_CTS_SDA_SSEL0_PORT
    #define SPI1_SSEL_PIN        RTE_FC1_CTS_SDA_SSEL0_PIN
    #define SPI1_SSEL_FUNC       RTE_FC1_CTS_SDA_SSEL0_FUNC
    #define SPI1_SSEL_NUM        0
  #endif
  #if (RTE_FC1_RTS_SCL_SSEL1_EN != 0)
    #define SPI1_SSEL_PORT       RTE_FC1_RTS_SCL_SSEL1_PORT
    #define SPI1_SSEL_PIN        RTE_FC1_RTS_SCL_SSEL1_PIN
    #define SPI1_SSEL_FUNC       RTE_FC1_RTS_SCL_SSEL1_FUNC
    #define SPI1_SSEL_NUM        1
  #endif

  #if (RTE_FC1_DMA_RX_I2CS != 0) || (RTE_FC1_DMA_TX_I2CM != 0)
    #if (RTE_FC1_DMA_RX_I2CS != 0) && (RTE_FC1_DMA_TX_I2CM != 0)
      #define SPI1_DMA_EN        1
    #else
      #error "SPI1 requires Rx and Tx channel configured in RTE_Device.h when using DMA data transfer!"
    #endif
  #endif
#endif

#if (RTE_FC2 != 0) && (RTE_FC2_PERSEL == 1) /* SPI2 */
  #define RTE_SPI2               1

  #if (RTE_FC2_SCK_EN == 0)
    #error "Mandatory SPI2 SCK pin is not configured in RTE_Device.h!"
  #endif
  #if (RTE_FC2_RXD_SDA_MOSI_EN == 0)
    #error "Mandatory SPI2 MOSI pin is not configured in RTE_Device.h!"
  #endif
  #if (RTE_FC2_TXD_SCL_MISO_EN == 0)
    #error "Mandatory SPI2 MISO pin is not configured in RTE_Device.h!"
  #endif

