qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/SPI_LPC5411x.h
  #define SPI2_MOSI_PORT         RTE_FC2_RXD_SDA_MOSI_PORT
  #define SPI2_MOSI_PIN          RTE_FC2_RXD_SDA_MOSI_PIN
  #define SPI2_MOSI_FUNC         RTE_FC2_RXD_SDA_MOSI_FUNC

  #define SPI2_MISO_PORT         RTE_FC2_TXD_SCL_MISO_PORT
  #define SPI2_MISO_PIN          RTE_FC2_TXD_SCL_MISO_PIN
  #define SPI2_MISO_FUNC         RTE_FC2_TXD_SCL_MISO_FUNC

  #define SPI2_SCK_PORT          RTE_FC2_SCK_PORT
  #define SPI2_SCK_PIN           RTE_FC2_SCK_PIN
  #define SPI2_SCK_FUNC          RTE_FC2_SCK_FUNC

  #if ((RTE_FC2_CTS_SDA_SSEL0_EN + RTE_FC2_RTS_SCL_SSEL1_EN + RTE_FC2_SSEL2_EN + RTE_FC2_SSEL3_EN) > 1)
    #error "Select only one pin for SPI2 SSEL (FC2_CTS_SDA_SSEL0, FC2_RTS_SCL_SSEL1, FC2_SSEL2, FC2_SSEL3) in RTE_Device.h!"
  #endif

  #if (RTE_FC2_CTS_SDA_SSEL0_EN != 0)
    #define SPI2_SSEL_PORT       RTE_FC2_CTS_SDA_SSEL0_PORT
    #define SPI2_SSEL_PIN        RTE_FC2_CTS_SDA_SSEL0_PIN
    #define SPI2_SSEL_FUNC       RTE_FC2_CTS_SDA_SSEL0_FUNC
    #define SPI2_SSEL_NUM        0
  #endif
  #if (RTE_FC2_RTS_SCL_SSEL1_EN != 0)
    #define SPI2_SSEL_PORT       RTE_FC2_RTS_SCL_SSEL1_PORT
    #define SPI2_SSEL_PIN        RTE_FC2_RTS_SCL_SSEL1_PIN
    #define SPI2_SSEL_FUNC       RTE_FC2_RTS_SCL_SSEL1_FUNC
    #define SPI2_SSEL_NUM        1
  #endif

  #if (RTE_FC2_DMA_RX_I2CS != 0) || (RTE_FC2_DMA_TX_I2CM != 0)
    #if (RTE_FC2_DMA_RX_I2CS != 0) && (RTE_FC2_DMA_TX_I2CM != 0)
      #define SPI2_DMA_EN        1
    #else
      #error "SPI2 requires Rx and Tx channel configured in RTE_Device.h when using DMA data transfer!"
    #endif
  #endif
#endif

#if (RTE_FC3 != 0) && (RTE_FC3_PERSEL == 1) /* SPI3 */
  #define RTE_SPI3               1

  #if (RTE_FC3_SCK_EN == 0)
    #error "Mandatory SPI3 SCK pin is not configured in RTE_Device.h!"
  #endif
  #if (RTE_FC3_RXD_SDA_MOSI_EN == 0)
    #error "Mandatory SPI3 MOSI pin is not configured in RTE_Device.h!"
  #endif
  #if (RTE_FC3_TXD_SCL_MISO_EN == 0)
    #error "Mandatory SPI3 MISO pin is not configured in RTE_Device.h!"
  #endif

  #define SPI3_MOSI_PORT         RTE_FC3_RXD_SDA_MOSI_PORT
  #define SPI3_MOSI_PIN          RTE_FC3_RXD_SDA_MOSI_PIN
  #define SPI3_MOSI_FUNC         RTE_FC3_RXD_SDA_MOSI_FUNC

  #define SPI3_MISO_PORT         RTE_FC3_TXD_SCL_MISO_PORT
  #define SPI3_MISO_PIN          RTE_FC3_TXD_SCL_MISO_PIN
  #define SPI3_MISO_FUNC         RTE_FC3_TXD_SCL_MISO_FUNC

  #define SPI3_SCK_PORT          RTE_FC3_SCK_PORT
  #define SPI3_SCK_PIN           RTE_FC3_SCK_PIN
  #define SPI3_SCK_FUNC          RTE_FC3_SCK_FUNC

  #if ((RTE_FC3_CTS_SDA_SSEL0_EN + RTE_FC3_RTS_SCL_SSEL1_EN + RTE_FC3_SSEL2_EN + RTE_FC3_SSEL3_EN) > 1)
    #error "Select only one pin for SPI3 SSEL (FC3_CTS_SDA_SSEL0, FC3_RTS_SCL_SSEL1, FC3_SSEL2, FC3_SSEL3) in RTE_Device.h!"
  #endif

  #if (RTE_FC3_CTS_SDA_SSEL0_EN != 0)
    #define SPI3_SSEL_PORT       RTE_FC3_CTS_SDA_SSEL0_PORT
    #define SPI3_SSEL_PIN        RTE_FC3_CTS_SDA_SSEL0_PIN
    #define SPI3_SSEL_FUNC       RTE_FC3_CTS_SDA_SSEL0_FUNC
    #define SPI3_SSEL_NUM        0
  #endif
  #if (RTE_FC3_RTS_SCL_SSEL1_EN != 0)
    #define SPI3_SSEL_PORT       RTE_FC3_RTS_SCL_SSEL1_PORT
    #define SPI3_SSEL_PIN        RTE_FC3_RTS_SCL_SSEL1_PIN
    #define SPI3_SSEL_FUNC       RTE_FC3_RTS_SCL_SSEL1_FUNC
    #define SPI3_SSEL_NUM        1
  #endif
  #if (RTE_FC3_SSEL2_EN != 0)
    #define SPI3_SSEL_PORT       RTE_FC3_SSEL2_PORT
    #define SPI3_SSEL_PIN        RTE_FC3_SSEL2_PIN
    #define SPI3_SSEL_FUNC       RTE_FC3_SSEL2_FUNC
    #define SPI3_SSEL_NUM        2
  #endif
  #if (RTE_FC3_SSEL3_EN != 0)
    #define SPI3_SSEL_PORT       RTE_FC3_SSEL3_PORT
    #define SPI3_SSEL_PIN        RTE_FC3_SSEL3_PIN
    #define SPI3_SSEL_FUNC       RTE_FC3_SSEL3_FUNC
    #define SPI3_SSEL_NUM        3
  #endif

  #if (RTE_FC3_DMA_RX_I2CS != 0) || (RTE_FC3_DMA_TX_I2CM != 0)
    #if (RTE_FC3_DMA_RX_I2CS != 0) && (RTE_FC3_DMA_TX_I2CM != 0)
      #define SPI3_DMA_EN        1
    #else
      #error "SPI3 requires Rx and Tx channel configured in RTE_Device.h when using DMA data transfer!"
    #endif
  #endif
#endif

#if (RTE_FC4 != 0) && (RTE_FC4_PERSEL == 1) /* SPI4 */
  #define RTE_SPI4               1

  #if (RTE_FC4_SCK_EN == 0)
    #error "Mandatory SPI4 SCK pin is not configured in RTE_Device.h!"
  #endif
  #if (RTE_FC4_RXD_SDA_MOSI_EN == 0)
    #error "Mandatory SPI4 MOSI pin is not configured in RTE_Device.h!"
  #endif
  #if (RTE_FC4_TXD_SCL_MISO_EN == 0)
    #error "Mandatory SPI4 MISO pin is not configured in RTE_Device.h!"
  #endif

  #define SPI4_MOSI_PORT         RTE_FC4_RXD_SDA_MOSI_PORT
  #define SPI4_MOSI_PIN          RTE_FC4_RXD_SDA_MOSI_PIN
  #define SPI4_MOSI_FUNC         RTE_FC4_RXD_SDA_MOSI_FUNC

  #define SPI4_MISO_PORT         RTE_FC4_TXD_SCL_MISO_PORT
  #define SPI4_MISO_PIN          RTE_FC4_TXD_SCL_MISO_PIN
  #define SPI4_MISO_FUNC         RTE_FC4_TXD_SCL_MISO_FUNC

  #define SPI4_SCK_PORT          RTE_FC4_SCK_PORT
  #define SPI4_SCK_PIN           RTE_FC4_SCK_PIN
  #define SPI4_SCK_FUNC          RTE_FC4_SCK_FUNC

  #if ((RTE_FC4_CTS_SDA_SSEL0_EN + RTE_FC4_RTS_SCL_SSEL1_EN) > 1)
    #error "Select only one pin for SPI4 SSEL (FC4_CTS_SDA_SSEL0 or FC4_RTS_SCL_SSEL1) in RTE_Device.h!"
  #endif

  #if (RTE_FC4_CTS_SDA_SSEL0_EN != 0)
    #define SPI4_SSEL_PORT       RTE_FC4_CTS_SDA_SSEL0_PORT
    #define SPI4_SSEL_PIN        RTE_FC4_CTS_SDA_SSEL0_PIN
    #define SPI4_SSEL_FUNC       RTE_FC4_CTS_SDA_SSEL0_FUNC
    #define SPI4_SSEL_NUM        0
  #endif
  #if (RTE_FC4_RTS_SCL_SSEL1_EN != 0)
    #define SPI4_SSEL_PORT       RTE_FC4_RTS_SCL_SSEL1_PORT
    #define SPI4_SSEL_PIN        RTE_FC4_RTS_SCL_SSEL1_PIN
    #define SPI4_SSEL_FUNC       RTE_FC4_RTS_SCL_SSEL1_FUNC
    #define SPI4_SSEL_NUM        1
  #endif

  #if (RTE_FC4_DMA_RX_I2CS != 0) || (RTE_FC4_DMA_TX_I2CM != 0)
    #if (RTE_FC4_DMA_RX_I2CS != 0) && (RTE_FC4_DMA_TX_I2CM != 0)
      #define SPI4_DMA_EN        1
    #else
      #error "SPI4 requires Rx and Tx channel configured in RTE_Device.h when using DMA data transfer!"
    #endif
  #endif
#endif

#if (RTE_FC5 != 0) && (RTE_FC5_PERSEL == 1) /* SPI5 */
  #define RTE_SPI5               1

  #if (RTE_FC5_SCK_EN == 0)
    #error "Mandatory SPI5 SCK pin is not configured in RTE_Device.h!"
  #endif
  #if (RTE_FC5_RXD_SDA_MOSI_EN == 0)
    #error "Mandatory SPI5 MOSI pin is not configured in RTE_Device.h!"
  #endif
  #if (RTE_FC5_TXD_SCL_MISO_EN == 0)
    #error "Mandatory SPI5 MISO pin is not configured in RTE_Device.h!"
  #endif

  #define SPI5_MOSI_PORT         RTE_FC5_RXD_SDA_MOSI_PORT
  #define SPI5_MOSI_PIN          RTE_FC5_RXD_SDA_MOSI_PIN
  #define SPI5_MOSI_FUNC         RTE_FC5_RXD_SDA_MOSI_FUNC

  #define SPI5_MISO_PORT         RTE_FC5_TXD_SCL_MISO_PORT
  #define SPI5_MISO_PIN          RTE_FC5_TXD_SCL_MISO_PIN
  #define SPI5_MISO_FUNC         RTE_FC5_TXD_SCL_MISO_FUNC

  #define SPI5_SCK_PORT          RTE_FC5_SCK_PORT
  #define SPI5_SCK_PIN           RTE_FC5_SCK_PIN
  #define SPI5_SCK_FUNC          RTE_FC5_SCK_FUNC

