qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/SPI_LPC5411x.h
  #if ((RTE_FC5_CTS_SDA_SSEL0_EN + RTE_FC5_RTS_SCL_SSEL1_EN + RTE_FC5_SSEL2_EN + RTE_FC5_SSEL3_EN) > 1)
    #error "Select only one pin for SPI5 SSEL (FC5_CTS_SDA_SSEL0, FC5_RTS_SCL_SSEL1, FC5_SSEL2, FC5_SSEL3) in RTE_Device.h!"
  #endif

  #if (RTE_FC5_CTS_SDA_SSEL0_EN != 0)
    #define SPI5_SSEL_PORT       RTE_FC5_CTS_SDA_SSEL0_PORT
    #define SPI5_SSEL_PIN        RTE_FC5_CTS_SDA_SSEL0_PIN
    #define SPI5_SSEL_FUNC       RTE_FC5_CTS_SDA_SSEL0_FUNC
    #define SPI5_SSEL_NUM        0
  #endif
  #if (RTE_FC5_RTS_SCL_SSEL1_EN != 0)
    #define SPI5_SSEL_PORT       RTE_FC5_RTS_SCL_SSEL1_PORT
    #define SPI5_SSEL_PIN        RTE_FC5_RTS_SCL_SSEL1_PIN
    #define SPI5_SSEL_FUNC       RTE_FC5_RTS_SCL_SSEL1_FUNC
    #define SPI5_SSEL_NUM        1
  #endif
  #if (RTE_FC5_SSEL2_EN != 0)
    #define SPI5_SSEL_PORT       RTE_FC5_SSEL2_PORT
    #define SPI5_SSEL_PIN        RTE_FC5_SSEL2_PIN
    #define SPI5_SSEL_FUNC       RTE_FC5_SSEL2_FUNC
    #define SPI5_SSEL_NUM        2
  #endif
  #if (RTE_FC5_SSEL3_EN != 0)
    #define SPI5_SSEL_PORT       RTE_FC5_SSEL3_PORT
    #define SPI5_SSEL_PIN        RTE_FC5_SSEL3_PIN
    #define SPI5_SSEL_FUNC       RTE_FC5_SSEL3_FUNC
    #define SPI5_SSEL_NUM        3
  #endif

  #if (RTE_FC5_DMA_RX_I2CS != 0) || (RTE_FC5_DMA_TX_I2CM != 0)
    #if (RTE_FC5_DMA_RX_I2CS != 0) && (RTE_FC5_DMA_TX_I2CM != 0)
      #define SPI5_DMA_EN        1
    #else
      #error "SPI5 requires Rx and Tx channel configured in RTE_Device.h when using DMA data transfer!"
    #endif
  #endif
#endif

#if (RTE_FC6 != 0) && (RTE_FC6_PERSEL == 1) /* SPI6 */
  #define RTE_SPI6               1

  #if (RTE_FC6_SCK_EN == 0)
    #error "Mandatory SPI6 SCK pin is not configured in RTE_Device.h!"
  #endif
  #if (RTE_FC6_RXD_SDA_MOSI_EN == 0)
    #error "Mandatory SPI6 MOSI pin is not configured in RTE_Device.h!"
  #endif
  #if (RTE_FC6_TXD_SCL_MISO_EN == 0)
    #error "Mandatory SPI6 MISO pin is not configured in RTE_Device.h!"
  #endif

  #define SPI6_MOSI_PORT         RTE_FC6_RXD_SDA_MOSI_PORT
  #define SPI6_MOSI_PIN          RTE_FC6_RXD_SDA_MOSI_PIN
  #define SPI6_MOSI_FUNC         RTE_FC6_RXD_SDA_MOSI_FUNC

  #define SPI6_MISO_PORT         RTE_FC6_TXD_SCL_MISO_PORT
  #define SPI6_MISO_PIN          RTE_FC6_TXD_SCL_MISO_PIN
  #define SPI6_MISO_FUNC         RTE_FC6_TXD_SCL_MISO_FUNC

  #define SPI6_SCK_PORT          RTE_FC6_SCK_PORT
  #define SPI6_SCK_PIN           RTE_FC6_SCK_PIN
  #define SPI6_SCK_FUNC          RTE_FC6_SCK_FUNC

  #if ((RTE_FC6_CTS_SDA_SSEL0_EN + RTE_FC6_RTS_SCL_SSEL1_EN) > 1)
    #error "Select only one pin for SPI6 SSEL (FC6_CTS_SDA_SSEL0 or FC6_RTS_SCL_SSEL1) in RTE_Device.h!"
  #endif

  #if (RTE_FC6_CTS_SDA_SSEL0_EN != 0)
    #define SPI6_SSEL_PORT       RTE_FC6_CTS_SDA_SSEL0_PORT
    #define SPI6_SSEL_PIN        RTE_FC6_CTS_SDA_SSEL0_PIN
    #define SPI6_SSEL_FUNC       RTE_FC6_CTS_SDA_SSEL0_FUNC
    #define SPI6_SSEL_NUM        0
  #endif
  #if (RTE_FC6_RTS_SCL_SSEL1_EN != 0)
    #define SPI6_SSEL_PORT       RTE_FC6_RTS_SCL_SSEL1_PORT
    #define SPI6_SSEL_PIN        RTE_FC6_RTS_SCL_SSEL1_PIN
    #define SPI6_SSEL_FUNC       RTE_FC6_RTS_SCL_SSEL1_FUNC
    #define SPI6_SSEL_NUM        1
  #endif

  #if (RTE_FC6_DMA_RX_I2CS != 0) || (RTE_FC6_DMA_TX_I2CM != 0)
    #if (RTE_FC6_DMA_RX_I2CS != 0) && (RTE_FC6_DMA_TX_I2CM != 0)
      #define SPI6_DMA_EN        1
    #else
      #error "SPI6 requires Rx and Tx channel configured in RTE_Device.h when using DMA data transfer!"
    #endif
  #endif
#endif

#if (RTE_FC7 != 0) && (RTE_FC7_PERSEL == 1) /* SPI7 */
  #define RTE_SPI7               1

  #if (RTE_FC7_SCK_EN == 0)
    #error "Mandatory SPI7 SCK pin is not configured in RTE_Device.h!"
  #endif
  #if (RTE_FC7_RXD_SDA_MOSI_EN == 0)
    #error "Mandatory SPI7 MOSI pin is not configured in RTE_Device.h!"
  #endif
  #if (RTE_FC7_TXD_SCL_MISO_EN == 0)
    #error "Mandatory SPI7 MISO pin is not configured in RTE_Device.h!"
  #endif

  #define SPI7_MOSI_PORT         RTE_FC7_RXD_SDA_MOSI_PORT
  #define SPI7_MOSI_PIN          RTE_FC7_RXD_SDA_MOSI_PIN
  #define SPI7_MOSI_FUNC         RTE_FC7_RXD_SDA_MOSI_FUNC

  #define SPI7_MISO_PORT         RTE_FC7_TXD_SCL_MISO_PORT
  #define SPI7_MISO_PIN          RTE_FC7_TXD_SCL_MISO_PIN
  #define SPI7_MISO_FUNC         RTE_FC7_TXD_SCL_MISO_FUNC

  #define SPI7_SCK_PORT          RTE_FC7_SCK_PORT
  #define SPI7_SCK_PIN           RTE_FC7_SCK_PIN
  #define SPI7_SCK_FUNC          RTE_FC7_SCK_FUNC

  #if ((RTE_FC7_CTS_SDA_SSEL0_EN + RTE_FC7_RTS_SCL_SSEL1_EN + RTE_FC7_SSEL2_EN + RTE_FC7_SSEL3_EN) > 1)
    #error "Select only one pin for SPI7 SSEL (FC7_CTS_SDA_SSEL0, FC7_RTS_SCL_SSEL1, FC7_SSEL2, FC7_SSEL3) in RTE_Device.h!"
  #endif

  #if (RTE_FC7_CTS_SDA_SSEL0_EN != 0)
    #define SPI7_SSEL_PORT       RTE_FC7_CTS_SDA_SSEL0_PORT
    #define SPI7_SSEL_PIN        RTE_FC7_CTS_SDA_SSEL0_PIN
    #define SPI7_SSEL_FUNC       RTE_FC7_CTS_SDA_SSEL0_FUNC
    #define SPI7_SSEL_NUM        0
  #endif
  #if (RTE_FC7_RTS_SCL_SSEL1_EN != 0)
    #define SPI7_SSEL_PORT       RTE_FC7_RTS_SCL_SSEL1_PORT
    #define SPI7_SSEL_PIN        RTE_FC7_RTS_SCL_SSEL1_PIN
    #define SPI7_SSEL_FUNC       RTE_FC7_RTS_SCL_SSEL1_FUNC
    #define SPI7_SSEL_NUM        1
  #endif
  #if (RTE_FC7_SSEL2_EN != 0)
    #define SPI7_SSEL_PORT       RTE_FC7_SSEL2_PORT
    #define SPI7_SSEL_PIN        RTE_FC7_SSEL2_PIN
    #define SPI7_SSEL_FUNC       RTE_FC7_SSEL2_FUNC
    #define SPI7_SSEL_NUM        2
  #endif
  #if (RTE_FC7_SSEL3_EN != 0)
    #define SPI7_SSEL_PORT       RTE_FC7_SSEL3_PORT
    #define SPI7_SSEL_PIN        RTE_FC7_SSEL3_PIN
    #define SPI7_SSEL_FUNC       RTE_FC7_SSEL3_FUNC
    #define SPI7_SSEL_NUM        3
  #endif

  #if (RTE_FC7_DMA_RX_I2CS != 0) || (RTE_FC7_DMA_TX_I2CM != 0)
    #if (RTE_FC7_DMA_RX_I2CS != 0) && (RTE_FC7_DMA_TX_I2CM != 0)
      #define SPI7_DMA_EN        1
    #else
      #error "SPI7 requires Rx and Tx channel configured in RTE_Device.h when using DMA data transfer!"
    #endif
  #endif
#endif

#if defined(SPI0_DMA_EN) || defined(SPI1_DMA_EN) || defined(SPI2_DMA_EN) || defined(SPI3_DMA_EN) || \
    defined(SPI4_DMA_EN) || defined(SPI5_DMA_EN) || defined(SPI6_DMA_EN) || defined(SPI7_DMA_EN)
  #define SPI_DMA_ENABLE         1
#endif


/* SPI instances */
#define SPI0_FLEXCOMM            0
#define SPI1_FLEXCOMM            1
#define SPI2_FLEXCOMM            2
#define SPI3_FLEXCOMM            3
#define SPI4_FLEXCOMM            4
#define SPI5_FLEXCOMM            5
#define SPI6_FLEXCOMM            6
#define SPI7_FLEXCOMM            7

/* SYSCON clock defines */
#define SPI0_SYSCON_CLOCK        SYSCON_CLOCK_FLEXCOMM0
#define SPI1_SYSCON_CLOCK        SYSCON_CLOCK_FLEXCOMM1
#define SPI2_SYSCON_CLOCK        SYSCON_CLOCK_FLEXCOMM2
#define SPI3_SYSCON_CLOCK        SYSCON_CLOCK_FLEXCOMM3
#define SPI4_SYSCON_CLOCK        SYSCON_CLOCK_FLEXCOMM3
#define SPI5_SYSCON_CLOCK        SYSCON_CLOCK_FLEXCOMM4
#define SPI6_SYSCON_CLOCK        SYSCON_CLOCK_FLEXCOMM5
#define SPI7_SYSCON_CLOCK        SYSCON_CLOCK_FLEXCOMM6

/* IOCON settings for SPI pins */
#define SPI_PIN_IOCON_RESET     (IOCON_MODE_PULLUP | \
                                 IOCON_DIGITAL_EN  | \
                                 IOCON_INPFILT_OFF)

#define SPI_PIN_IOCON           (IOCON_MODE_INACT | \
                                 IOCON_DIGITAL_EN | \
                                 IOCON_INPFILT_OFF)
                                 

/* I2C interrupt mask */
#define I2C_MASTER_INTERRUPTS   (I2C_INTENSET_MSTPENDING  | \
                                 I2C_INTENSET_MSTRARBLOSS | \
                                 I2C_INTENSET_MSTSTSTPERR)

