qm2813518589/LPC54606_Library/.pack/Keil/LPC54000_DFP.2.6.0/RTE_Driver/SPI_LPC5411x.h
#define I2C_SLAVE_INTERRUPTS    (I2C_INTENSET_SLVPENDING | \
                                 I2C_INTENSET_SLVNOTSTR  | \
                                 I2C_INTENSET_SLVDESEL)

/* I2C Driver state flags */
#define SPI_INIT       (uint8_t)(1U << 0)   // Driver initialized
#define SPI_POWER      (uint8_t)(1U << 1)   // Driver power on
#define SPI_SETUP      (uint8_t)(1U << 2)   // Driver configured
#define SPI_SS_SWCTRL  (uint8_t)(1U << 3)   // Software controlled SSEL
#define SPI_16B_FRAME  (uint8_t)(1U << 4)   // Frame length is 2 bytes
#define SPI_XFER_DMA   (uint8_t)(1U << 5)   // Transfers data using DMA

/* Transfer status flags */
#define XFER_CTRL_XPENDING  ((uint8_t)0x01) // Transfer pending
#define XFER_CTRL_ADDR_DONE ((uint8_t)0x02) // Addressing done

/* FIFO control register access pointer */
#define SPI_FIFOCTRL(x) *((uint16_t volatile *)((uint32_t)&(x->FIFOWR) + 2))

/* SPI Transfer Information (Run-Time) */
typedef struct spi_transfer_info {
  uint32_t              num;                // Total number of transfers
  uint8_t              *rx_buf;             // Rx data pointer
  uint8_t              *tx_buf;             // Tx data pointer
  uint32_t              rx_cnt;             // Rx data counter
  uint32_t              tx_cnt;             // Tx data counter
  uint32_t              rx_pend;            // Count of Rx pending transfers
  uint32_t              tx_pend;            // Count of Tx pending transfers
  uint32_t              def_val;            // Default transfer value
  uint32_t              dummy;              // Data dump variable
  uint32_t              ctrl;               // FIFO control value
} SPI_TRANSFER_INFO;

/* SPI status */
typedef struct spi_status {
  uint8_t busy;                             // Tx/Rx busy flag
  uint8_t data_lost;                        // Data lost: Rx overflow / Tx underflow
} SPI_STATUS;

/* I2C Control Information */
typedef struct spi_info {
  ARM_SPI_SignalEvent_t cb_event;           // Event callback
  SPI_TRANSFER_INFO     xfer;               // Transfer configuration
  SPI_STATUS            status;             // Status flags
  uint8_t               flags;              // Control and state flags
} SPI_INFO;

/* SPI DMA Information */
typedef const struct spi_dma {
  DMA_CHID_T     ch;                        // Channel ID
  DMA_CALLBACK_T callback;                  // Channel callback function
} SPI_DMA;

/* SPI pin description */
typedef struct spi_pin {
  uint8_t port;                             // Port number
  uint8_t pin;                              // Pin number
  uint8_t func;                             // Pin function
} SPI_PIN;

/* SPI SSEL pin description */
typedef struct spi_ssel {
  uint8_t port;                             // Port number
  uint8_t pin;                              // Pin number
  uint8_t func;                             // Pin function
  uint8_t num;                              // Slave select number
} const SPI_SSEL;

/* SPI Resource Configuration */
typedef struct spi_resources {
  LPC_SPI_T            *reg;                // SPI register interface
  IRQn_Type             irqn;               // SPI IRQ Number in NVIC
  CHIP_SYSCON_CLOCK_T   clk_msk;            // APB clock control bit mask
  SPI_PIN               mosi;               // SPI MOSI pin
  SPI_PIN               miso;               // SPI MISO pin
  SPI_PIN               sck;                // SPI SCK pin
  SPI_SSEL             *ssel;               // SPI SSEL pin
  SPI_DMA              *dma_tx;             // Tx DMA info
  SPI_DMA              *dma_rx;             // Rx DMA info
  SPI_INFO             *info;               // Run-Time control information
} const SPI_RESOURCES;

#endif /* __SPI_LPC5411X_H */
